# 1.

In [1]:
from pandas import DataFrame
df = DataFrame(
                [
                   ['Aryan','Singh','Full-Time','Administration',2,20000],
                   ['Rohan','Agarwal','Intern','Technical',3,5000],
                   ['Riya','Shah','Full-Time','Administration',5,10000],
                   ['Yash','Bhatia','Part-Time','Technical',7,100000],
                   ['Siddhant','Khanna','Full-Time','Management',6,200000]
                ]
                ,columns=['First Name','Last Name','Type','Department','YoE','Salary']

              )
                
df

  First Name Last Name       Type      Department  YoE  Salary
0      Aryan     Singh  Full-Time  Administration    2   20000
1      Rohan   Agarwal     Intern       Technical    3    5000
2       Riya      Shah  Full-Time  Administration    5   10000
3       Yash    Bhatia  Part-Time       Technical    7  100000
4   Siddhant    Khanna  Full-Time      Management    6  200000

 Make a pivot table which shows average salary of each type of employee for each
department.

In [2]:
import pandas as pd
table = pd.pivot_table(df,index="Type",columns="Department",values="Salary",aggfunc="mean")
table

Department  Administration  Management  Technical
Type
Full-Time          15000.0    200000.0        NaN
Intern                 NaN         NaN     5000.0
Part-Time              NaN         NaN   100000.0

Make a pivot table which shows the sum and mean of the salaries of each type of
employee and the number of employees of each type

In [3]:
table1 = pd.pivot_table(df,index="Type",values='Salary',aggfunc=['sum','mean','count'],)
table1

              sum           mean  count
           Salary         Salary Salary
Type
Full-Time  230000   76666.666667      3
Intern       5000    5000.000000      1
Part-Time  100000  100000.000000      1

In [5]:
df.iloc[:,0:2]

  First Name Last Name
0      Aryan     Singh
1      Rohan   Agarwal
2       Riya      Shah
3       Yash    Bhatia
4   Siddhant    Khanna

In [ ]:
Display a pivot table to count survival rating by gender ,categorize wise age of various classes
category1 0-10
category2 10-30
category3 30-60
category3 60-80

In [1]:
import pandas as pd
df = pd.read_csv("dataset/titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,NaN,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,NaN,3,"Heikkinen, Miss. Laina",female,NaN,0,0,STON/O2. 3101282,NaN,NaN,S
3,4,NaN,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0.0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1.0,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0.0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1.0,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0.0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [15]:
import pandas as pd
import numpy as np
df = pd.read_csv('dataset/titanic.csv')
result = df.pivot_table(values=['Survived'], index=['Sex'], columns='Pclass', aggfunc='count')
print(result)

       Survived
Pclass        1    2    3
Sex
female       92   76  143
male        122  108  346